#Урок-1
#Задача-1

#Поработайте с переменными, создайте несколько, выведите на экран,
#запросите у пользователя несколько чисел и строк и сохраните в переменные,
#выведите на экран.
#Решение-задачи-1
print("Решение-задачи-1")
print("")
a = 1
b = 2
c = a + b

print ("Заданы переменные а=, b=, c=a+b:", a, b, c)
print("")
string_1 = input("Введите первую переменную (буквы) - ")
string_2 = input("Введите вторую переменную (буквы) - ")
number_1 = int(input("Введите третью переменную (число) - "))
number_2 = int(input("Введите четвертую переменную (число) - "))
print ("Ты ввел последовательно -", string_1, string_2, number_1, number_2)
